[
	{
		"id": 1,
		"company": "WyseGuysLab",
		"translations": {
			"en": {
				"role": "Full Stack Developer",
				"startDate": "01/2025",
				"endDate": "10/2025",
				"tasks": [
					{
						"id": 1,
						"description": "Developed new features for web applications, using technologies like JavaScript, MongoDB, Express.js, React, Node.js, GraphQL, etc. While working in a team to implement efficient solutions."
					},
					{
						"id": 2,
						"description": "Contributed to the optimization and maintenance of existing code, fixing bugs and improving application performance for a better user experience."
					},
					{
						"id": 3,
						"description": "Worked in an agile development environment, collaborating with designers and other developers, and participating in daily stand-ups and code reviews to ensure product quality."
					}
				]
			},
			"es-419": {
				"role": "Desarrollador Full Stack",
				"startDate": "01/2025",
				"endDate": "10/2025",
				"tasks": [
					{
						"id": 1,
						"description": "Desarrollé nuevas funcionalidades para aplicaciones web, utilizando tecnologías como JavaScript, MongoDB, Express.js, React, Node.js, GraphQL, etc. Mientras trabajaba en equipo para implementar soluciones eficientes."
					},
					{
						"id": 2,
						"description": "Contribuí a la optimización y mantenimiento del código existente, corrigiendo errores y mejorando el rendimiento de las aplicaciones para una mejor experiencia de usuario."
					},
					{
						"id": 3,
						"description": "Trabajé en un entorno de desarrollo ágil, colaborando con diseñadores y otros desarrolladores, participando en daily stand-ups y revisiones de código para garantizar la calidad del producto."
					}
				]
			}
		}
	},
	{
		"id": 2,
		"company": "DDS Lab",
		"translations": {
			"en": {
				"role": "CAM Team Leader",
				"startDate": "03/2024",
				"endDate": "01/2025",
				"tasks": [
					{
						"id": 1,
						"description": "Coordinated the operations of the CAM team, ensuring the quality of dental parts through constant inspections and technical protocols."
					},
					{
						"id": 2,
						"description": "Performed preventive and corrective maintenance on industrial machinery and computer systems, resolving technical failures in record time and ensuring good operational availability."
					},
					{
						"id": 3,
						"description": "Train new employees using the best possible practices, guiding them every step of the way and striving to make their learning experience as positive as possible."
					}
				]
			},
			"es-419": {
				"role": "Líder de Equipo CAM",
				"startDate": "03/2024",
				"endDate": "01/2025",
				"tasks": [
					{
						"id": 1,
						"description": "Coordiné las operaciones del equipo CAM, asegurando la calidad de las piezas dentales mediante inspecciones constantes y protocolos técnicos."
					},
					{
						"id": 2,
						"description": "Realicé mantenimiento preventivo y correctivo en maquinaria industrial y sistemas informáticos, resolviendo fallos técnicos en tiempo récord y garantizando una buena disponibilidad operativa."
					},
					{
						"id": 3,
						"description": "Capacité a nuevos empleados utilizando las mejores prácticas posibles, guiándolos en cada paso del proceso y esforzándome por hacer su experiencia de aprendizaje lo más positiva posible."
					}
				]
			}
		}
	}
]
